# Імпортує модулі:
#       random - для створення випадкових чисел,
#       Health_exception - якщо гравець втратив усі життя відбувається помилка,
#       time - для сну комп'ютера.
import random
from health_exception import Health_exception
import time


# клас Hard для відстеження кількості життів.
class Hard_ua:

    def __init__(self):
        self._health = 10       # вказує, що у персонажа 10 життів.
        self.DICE_ART = {       # створює більш елегантні картинки для гри "Кидання кубиків".
            1: (
                "┌─────────┐",
                "│         │",
                "│    ●    │",
                "│         │",
                "└─────────┘",
            ),
            2: (
                "┌─────────┐",
                "│  ●      │",
                "│         │",
                "│      ●  │",
                "└─────────┘",
            ),
            3: (
                "┌─────────┐",
                "│  ●      │",
                "│    ●    │",
                "│      ●  │",
                "└─────────┘",
            ),
            4: (
                "┌─────────┐",
                "│  ●   ●  │",
                "│         │",
                "│  ●   ●  │",
                "└─────────┘",
            ),
            5: (
                "┌─────────┐",
                "│  ●   ●  │",
                "│    ●    │",
                "│  ●   ●  │",
                "└─────────┘",
            ),
            6: (
                "┌─────────┐",
                "│  ●   ●  │",
                "│  ●   ●  │",
                "│  ●   ●  │",
                "└─────────┘",
            ),
        }
        self.DICE_HEIGHT = len(self.DICE_ART[1])
        self.DICE_WIDTH = len(self.DICE_ART[1][0])
        self.DICE_FACE_SEPARATOR = " "

    # Перша гра "Вгадай число".
    def game1(self):
        print('\nЦя гра називається "Вгадай число".\nКомп\'ютер загадав число від 1 до 10...')
        time.sleep(6)       # викликає функцію sleep на 6 сек, щоб гравець встиг прочитати весь текст.
        clue = 1            # створює кількість підказок, щоб потім давати їх у грі.
        number = 7          # комп'ютер загадав число 7, бо торговий центр згорів 7-го червня.
        num = int(input('\nОбери число (від 1 до 10): '))
        all_num = set()     # створює множину, яке не показує повторювані числа.
        while num != number:        # створює while цикл, щоб перевірити чи дорівнює ваше число з загаданим числом.
            self._health -= 1       # якщо гравець не вгадав число, то забирається одне життя.
            if self._health == 0:   # якщо закінчились усі життя, відбувається виключення.
                raise Health_exception(self._health)
            all_num.add(num)        # додає попередні обрані числа.
            print(f'\nОй... Не вгадав!\nВи втратили одне життя.\nУ вас залишилося життів {self._health}.')
            time.sleep(6)
            if clue == 1:           # дає першу підказку
                print('\nЯ тобі дам одну підказку.\nЦе число більше 5.')
                time.sleep(4)
            elif clue == 2:         # дає другу підказку
                print('\nЩе одна підказка. Це непарне число.')
                time.sleep(4)
            print(f'\n(Ти вже обрав {sorted(set(all_num))})')
            num = int(input('Обери число (від 1 до 10): '))
            clue += 1       # щоб показати одну підказку в одному колі і другу підказку в іншому.
        else:               # якщо число гравця дорівнює числу, що загадав комп'ютер, то ви перемогли.
            print(f'\nМої вітання, ви перемогли!!!\nУ вас залишилося життів {self._health}.')
            time.sleep(6)
            return 1

    # Друга гра "Кидання кубиків".
    def game2(self):
        print('\nЦя гра називається "Кидання кубиків".'
              '\nВи повинні кинути кубики так, щоб сума цифр була більшою або дорівнювала 8.')
        time.sleep(12)          # викликає функцію sleep на 12 сек, щоб гравець встиг прочитати весь текст.
        input('\nБудь ласка напишіть слово "кинути". ')

        # генерує список для випадкових чисел.
        rand_choice = []
        # додає до списку випадковий вибір чисел завдяки модулю random.
        for i in range(2):
            rand_choice.append(random.randint(1, 6))
        while True:
            # генерує список з ключами картинок зі списку DICE_ART.
            dice_faces = []
            for value in rand_choice:
                dice_faces.append(self.DICE_ART[value])

            # генерує список, у якому містяться картинки з кістками.
            dice_faces_rows = []
            for row_idx in range(self.DICE_HEIGHT):
                row_components = []
                for die in dice_faces:
                    row_components.append(die[row_idx])
                row_string = self.DICE_FACE_SEPARATOR.join(row_components)
                dice_faces_rows.append(row_string)

            # генерує назву "Результат" посередині.
            width = len(dice_faces_rows[0])
            diagram_header = " Результат ".center(width, "~")

            # diagram_header приєднуємо до dice_faces_rows.
            dice_face_diagram = "\n".join([diagram_header] + dice_faces_rows)
            print(f"\n{dice_face_diagram}")

            # Перевіряє чи сума цифр більша або дорівнює 8.
            if (rand_choice[0] + rand_choice[1]) >= 8:
                print(f"Ви перемогли. Життів залишилося {self._health}.")
                time.sleep(5)
                break

            # якщо ні — то забирається одне життя.
            self._health -= 1
            print(f'Погана вдача. Життів залишилося {self._health}.')
            time.sleep(4)

            # якщо закінчились усі життя, відбувається виключення.
            if self._health == 0:
                raise Health_exception(self._health)

            # і знову генерує список для випадкових чисел.
            input('\nБудь ласка напишіть слово "кинути". ')
            rand_choice = []
            for i in range(2):
                rand_choice.append(random.randint(1, 6))
        return 1

    # Третя гра "Камінь, ножиці, папір".
    def game3(self):
        # створення кортежу з трьох варіантів "камінь", "папір" або "ножиці".
        game_list = ('камінь', 'папір', 'ножиці')
        print('\nЦя гра називається "Камінь, ножиці, папір".'
              '\nКомп\'ютер обирає один з варіантів, а ти, в свою чергу, повинен обрати той предмет який переможе його.'
              '\nКамінь б\'є ножиці, ножиці ріжуть папір, папір загортає камінь.')
        time.sleep(17)      # викликає функцію sleep на 19 сек, щоб гравець встиг прочитати весь текст.
        while True:
            # комп'ютер робить випадковий вибір серед game_list.
            comp_choice = random.choice(game_list)

            # гравець обирає свій предмет.
            user_choice = input('\nБудь ласка оберіть один із варіантів (камінь, ножиці, папір) ')

            # створення кортежу з вибором комп'ютера та гравця.
            choice = (comp_choice, user_choice)

            # використання Pattern Matching.
            match choice:
                # усі нічийні комбінації.
                case ('камінь', 'камінь') | ('папір', 'папір') | ('ножиці', 'ножиці'):
                    print(f'Комп\'ютер обрав {comp_choice}. Нічия. Давайте спробуємо ще раз.')
                    time.sleep(5)

                # усі переможні комбінації.
                case ('камінь', 'папір') | ('папір', 'ножиці') | ('ножиці', 'камінь'):
                    print(f'Комп\'ютер обрав {comp_choice}. Мої вітання. Ви перемогли.'
                          f'\nЖиттів залишилося {self._health}.')
                    time.sleep(8)
                    break

                # усі програшні комбінації.
                case ('камінь', 'ножиці') | ('папір', 'камінь') | ('ножиці', 'папір'):
                    self._health -= 1   # забирається одне життя.
                    print(f'Комп\'ютер обрав {comp_choice}. Комп\'ютер переміг. Ви втратили одне життя.'
                          f'\nЖиттів залишилося {self._health}.')
                    time.sleep(8)

            # якщо закінчились усі життя, відбувається виключення.
            if self._health == 0:
                raise Health_exception(self._health)

    # функція для відповіді на питання 1.
    def choice3(self):
        choice3 = input('Ви думаєте що це був ')
        # якщо відповідь не дорівнює "Майк" або "Майк Вільямс" знову повторює питання.
        # використовує функцію title, щоб зробити великою першу літеру.
        while choice3.title() != 'Майк' and choice3.title() != 'Майк Вільямс':
            self._health -= 1           # забирається одне життя.
            if self._health == 0:       # якщо закінчились усі життя, відбувається виключення.
                raise Health_exception(self._health)
            print(f'\nНі, будь ласка, подумайте і дайте відповідь ще раз.\nЖиттів залишилося {self._health}.')
            choice3 = input('\nХто підпалив торговельний центр? ')

    # функція для відповіді на питання 2.
    def choice4(self):
        choice4 = input('Ви думаєте що він обпік ')
        # якщо відповідь не дорівнює "руки" або "рука" знову повторює питання.
        # використовує функцію lower, щоб зробити слово з маленьких літер.
        while choice4.lower() != 'руки' and choice4.lower() != 'рука':
            self._health -= 1           # забирається одне життя.
            if self._health == 0:       # якщо закінчились усі життя, відбувається виключення.
                raise Health_exception(self._health)
            print(f'\nНі, будь ласка, подумайте і дайте відповідь ще раз.\nЖиттів залишилося {self._health}.')
            choice4 = input('\nЯка частина тіла Майка згоріла? ')

    # функція для відповіді на питання 3.
    def choice5(self):
        choice5 = input('Ви думаєте що це ')
        # якщо відповідь не дорівнює "7" знову повторює питання.
        while choice5 != '7':
            self._health -= 1           # забирається одне життя.
            if self._health == 0:       # якщо закінчились усі життя, відбувається виключення.
                raise Health_exception(self._health)
            print(f'\nНі, будь ласка, подумайте і дайте відповідь ще раз.\nЖиттів залишилося {self._health}.')
            choice5 = input('\nЯкого червня сталася пожежа?(число) ')

    # функція для відповіді на питання 4.
    def choice6(self):
        choice6 = input('Ви думаєте його ')
        # якщо відповідь не дорівнює "отруїли" знову повторює питання.
        # використовує функцію lower, щоб зробити слово з маленьких літер.
        while choice6.lower() != 'отруїли':
            self._health -= 1           # забирається одне життя.
            if self._health == 0:       # якщо закінчились усі життя, відбувається виключення.
                raise Health_exception(self._health)
            print(f'\nНі, будь ласка, подумайте і дайте відповідь ще раз.\nЖиттів залишилося {self._health}.')
            choice6 = input('\nЯк вбили Майка (пострілом, зарізали чи отруїли) ')
