# якщо тип дорівнює "choice", то викликається функція.
# ця функція повертає обране число.
def choice():
    num = input('Ви обрали варіант ')
    return num


# функція для відповіді на питання 1.
def question1():
    choice3 = input('Ви думаєте що це був ')
    # якщо відповідь не дорівнює "Майк" або "Майк Вільямс" знову повторює питання.
    # використовує функцію title, щоб зробити великою першу літеру.
    while choice3.title() != 'Майк' and choice3.title() != 'Майк Вільямс':
        print('Ні, будь ласка, подумайте і дайте відповідь ще раз.')
        choice3 = input('\nХто підпалив торговельний центр? ')


# функція для відповіді на питання 2.
def question2():
    choice4 = input('Ви думаєте що він обпік ')
    # якщо відповідь не дорівнює "руки" або "рука" знову повторює питання.
    # використовує функцію lower, щоб зробити слово з маленьких літер.
    while choice4.lower() != 'руки' and choice4.lower() != 'руку':
        print('Ні, будь ласка, подумайте і дайте відповідь ще раз.')
        choice4 = input('\nЯка частина тіла Майка згоріла? ')


# функція для відповіді на питання 3.
def question3():
    choice5 = input('Ви думаєте що це ')
    # якщо відповідь не дорівнює "7" знову повторює питання.
    while choice5 != '7':
        print('Ні, будь ласка, подумайте і дайте відповідь ще раз.')
        choice5 = input('\nЯкого червня сталася пожежа? (число) ')


# функція для відповіді на питання 4.
def question4():
    choice6 = input('Ви думаєте його ')
    # якщо відповідь не дорівнює "отруїли" знову повторює питання.
    # використовує функцію lower, щоб зробити слово з маленьких літер.
    while choice6.lower() != 'отруїли':
        print('Ні, будь ласка, подумайте і дайте відповідь ще раз.')
        choice6 = input('\nЯк вбили Майка? (застрелили, зарізали чи отруїли) ')
